blog.org
#+hugo_base_dir: .
#+options: author:nil

* About
  :PROPERTIES:
  :EXPORT_HUGO_SECTION: .
  :EXPORT_FILE_NAME: about
  :END:
  *I'm 663*, and this is my blog. This site was created in an attempt to
  aggregate my personal thoughts, interests, and useful information
  (such as technical guides).
  I've gone by many aliases online, the most widely known being 663,
  the alias that I use as the head administrator and owner of [[https://16chan.xyz/][16chan]].
  Currently I'm in the final year of my Computer Science program.

  If you're interested in getting in contact with me, or would like me
  to answer any questions regarding content on this site you can send me
  an email at [[mailto:admin@16chan.xyz][admin@16chan.xyz]].

** Useful Links
   - [[https://github.com/maksrago/im663.com][im663.com source]]
   - [[https://github.com/olOwOlo/hugo-theme-even][Even (im663 site theme) source]]

*** Some of my Sites
    - [[https://16chan.xyz/][16chan.xyz]]
    - [[https://imageboard.net/][imageboard.net]]
    - [[https://kinostream.gq/][kinostream.gq]]
    - [[https://im663.com/][im663.com]]


    View more of my projects [[https://github.com/maksrago][here]].

** Frequently Asked Questions
   - */Why did you choose 663 as your alias?/*
   - I was introduced to the film director [[https://en.wikipedia.org/wiki/Wong_Kar-wai][Wong Kar-wai]] and his 1994
     film /Chunking Express/ which really resonated
     with me. One of the characters from the film was called "Cop 663"
     and I really resonated with his character.


   - */Why did you start [[https://www.16chan.xyz][16chan.xyz]]?/*
   - I started to get extremely fed up with 4chan's content, I
     primarily browsed /g/ and /wsg/ at the time, and as time went on
     more and more low quality content was getting posted. Also,
     4chan's source code is not readily available, and I can't confirm
     that it's actually privacy respecting. My issues with 8chan was
     that anyone could create a board, leading to community
     fragmentation. I thought that starting a small tight knit
     imageboard would work better, and I haven't looked back thus far,
     really happy with 16chan is, and where it's going.


   - */What are your political beliefs?/*
   - I currently reside within the United States, and don't feel any
     affiliation with the Republican or Democratic Parties nor any of
     the current parties that are available. I am a conservative, in
     that I believe that less government intervention is usually
     better, however, I am for the most part very apolitical, and
     don't care about discussing politics. I am however a huge
     proponent of free speech and freedom of expression, and as such I
     happen to run an imageboard centered around said freedoms.


   - */What is your favorite film?/*
   - I don't think I can name one quintiscential film that I would
     choose as my all time favorite film, rather I can name a few of
     my favorites:
     - /[[https://en.wikipedia.org/wiki/Chungking_Express][Chungking Express]]/ (1994)
     - /[[https://en.wikipedia.org/wiki/Blind_Chance][Blind Chance]]/ (1987) (or /Przypadek/ in Polish)
     - /[[https://en.wikipedia.org/wiki/Solaris_(1972_film)][Solaris]]/ (1972)
     - /[[https://en.wikipedia.org/wiki/The_House_That_Jack_Built_(2018_film)][The House That Jack Built]]/ (2018)
