content/about.md
+++
title = "About"
draft = false
+++

**I'm 663**, and this is my blog. This site was created in an attempt to
aggregate my personal thoughts, interests, and useful information
(such as technical guides).
I've gone by many aliases online, the most widely known being 663,
the alias that I use as the head administrator and owner of [16chan](https://16chan.xyz/).
Currently I'm in the final year of my Computer Science program.

If you're interested in getting in contact with me, or would like me
to answer any questions regarding content on this site you can send me
an email at [admin@16chan.xyz](mailto:admin@16chan.xyz).


## Useful Links {#useful-links}

-   [im663.com source](https://github.com/maksrago/im663.com)
-   [Even (im663 site theme) source](https://github.com/olOwOlo/hugo-theme-even)


### Some of my Sites {#some-of-my-sites}

-   [16chan.xyz](https://16chan.xyz/)
-   [imageboard.net](https://imageboard.net/)
-   [kinostream.gq](https://kinostream.gq/)
-   [im663.com](https://kinostream.gq/)

View more of my projects [here](https://github.com/maksrago).


## Frequently Asked Questions {#frequently-asked-questions}

-   **_Why did you choose 663 as your alias?_**
-   I was introduced to the film director [Wong Kar-wai](https://en.wikipedia.org/wiki/Wong%5FKar-wai) and his 1994
    film _Chunking Express_ which really resonated
    with me. One of the characters from the film was called "Cop 663"
    and I really resonated with his character.

<!--listend-->

-   **_Why did you start [16chan.xyz](https://www.16chan.xyz)?_**
-   I started to get extremely fed up with 4chan's content, I
    primarily browsed _g_ and _wsg_ at the time, and as time went on
    more and more low quality content was getting posted. Also,
    4chan's source code is not readily available, and I can't confirm
    that it's actually privacy respecting. My issues with 8chan was
    that anyone could create a board, leading to community
    fragmentation. I thought that starting a small tight knit
    imageboard would work better, and I haven't looked back thus far,
    really happy with 16chan is, and where it's going.

<!--listend-->

-   **_What are your political beliefs?_**
-   I currently reside within the United States, and don't feel any
    affiliation with the Republican or Democratic Parties nor any of
    the current parties that are available. I am a conservative, in
    that I believe that less government intervention is usually
    better, however, I am for the most part very apolitical, and
    don't care about discussing politics. I am however a huge
    proponent of free speech and freedom of expression, and as such I
    happen to run an imageboard centered around said freedoms.

<!--listend-->

-   **_What is your favorite film?_**
-   I don't think I can name one quintiscential film that I would
    choose as my all time favorite film, rather I can name a few of
    my favorites:
    -   _[Chungking Express](https://en.wikipedia.org/wiki/Chungking%5FExpress)_ (1994)
    -   _[Blind Chance](https://en.wikipedia.org/wiki/Blind%5FChance)_ (1987) (or _Przypadek_ in Polish)
    -   _[Solaris](https://en.wikipedia.org/wiki/Solaris%5F(1972%5Ffilm))_ (1972)
    -   _[The House That Jack Built](https://en.wikipedia.org/wiki/The%5FHouse%5FThat%5FJack%5FBuilt%5F(2018%5Ffilm))_ (2018)